Revit 2027 API
SizingOptions.Viscosity Property
 The air or fluid viscosity in kg/(ft*s), defaults to the air dynamic viscosity at 20ºC.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Viscosity { get; set; }
Public Property Viscosity As Double
	Get
	Set
public:
property double Viscosity {
	double get ();
	void set (double value);
}
member Viscosity : float with get, set
Property Value
Double
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace